<a href="https://colab.research.google.com/github/minjae-083/colab_tutorial/blob/main/test1.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [ ]:
import pandas as pd
import matplotlib.pyplot as plt
import seaborn as sb

In [ ]:
# 남녀별 생존율 차이

df = sb.load_dataset('titanic')

# 성별로 그룹화, 생존율(평균) 계산
s = df.groupby('sex')[['survived']].mean() # []가 2개인 이유? 1개->'시리즈'를 선택, 2개->'데이터프레임'을 선택
print(s)

        survived
sex
female  0.742038
male    0.188908

In [ ]:
# [] 1개와 2개의 차이?
s1 = df.groupby('sex')['survived'].mean() # 시리즈 선택. 인덱스가 'sex', 값이 'survived'
s2 = df.groupby('sex')[['survived']].mean() # 데이터프레임 선택. 인덱스가 'sex', 컬럼이 'survived'

print(type(s1))  # <class 'pandas.core.series.Series'>
print(type(s2))  # <class 'pandas.core.frame.DataFrame'>

<class 'pandas.core.series.Series'>
<class 'pandas.core.frame.DataFrame'>

In [12]:
# 나이대별로 요금(fare) 지불에 차이가 있는가
# 나이대(10살로 묶음)로 묶어서 평균 지불 금액을 구하기
df = sb.load_dataset('titanic')

# 구간 생성
bins = range(0, 101, 10)
labels = [f"{i}~{i+9}" for i in bins[:-1]]

df['age_group'] = pd.cut(df['age'], bins=bins, labels=labels, right=True)
r = df.groupby('age_group')[['fare']].mean()
print(r)

                fare
age_group
0~9        30.434439
10~19      29.529531
20~29      28.306719
30~39      42.496100
40~49      41.163181
50~59      44.774802
60~69      45.910782
70~79      25.936680
80~89            NaN
90~99            NaN

<ipython-input-12-7ac2f5e9b086>:10: FutureWarning: The default of observed=False is deprecated and will be changed to True in a future version of pandas. Pass observed=False to retain current behavior or observed=True to adopt the future default and silence this warning.
  r = df.groupby('age_group')[['fare']].mean()

In [15]:
# 결측치가 많은 컬럼은 무엇인가? 어떻게 처리할 것인가?
# 결측치 비율
df.isnull().sum() / len(df)

survived       0.000000
pclass         0.000000
sex            0.000000
age            0.198653
sibsp          0.000000
parch          0.000000
fare           0.000000
embarked       0.002245
class          0.000000
who            0.000000
adult_male     0.000000
deck           0.772166
embark_town    0.002245
alive          0.000000
alone          0.000000
age_group      0.198653
dtype: float64